Revit 2027 API
ElementParameterFilter(FilterRule, Boolean) Constructor
 Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementParameterFilter(
	FilterRule filterRule,
	bool inverted
)
Public Sub New (
	filterRule As FilterRule,
	inverted As Boolean
)
public:
ElementParameterFilter(
	FilterRule^ filterRule,
	bool inverted
)
new :
        filterRule : FilterRule *
        inverted : bool -> ElementParameterFilter
Parameters
filterRule FilterRule
 The rule applied to test if the element passes this filter.
inverted Boolean
 True if the filter should match all elements which do not pass the filter rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementParameterFilter Class
ElementParameterFilter Overload
Autodesk.Revit.DB Namespace